app/views/lists/index.html.erb

        </div>
        <p class="card-text list-extract">You have <%= list.list_ingredients.count %> ingredients in this list</p>
---
SELECT "lists".* FROM "lists"
SELECT COUNT(*) FROM "list_ingredients" WHERE "list_ingredients"."list_id" = $1  [["list_id", 1]]