app/views/lists/show.html.erb

          <%= form_tag copy_to_fridge_lists_path do %>
            <% @list.list_ingredients.each do |list_ingredient| %>
---
SELECT "list_ingredients".* FROM "list_ingredients" WHERE "list_ingredients"."list_id" = $1  [["list_id", 1]]