app/views/recipes/_card_header_text.html.erb

  <div class="like-button">
    <% if current_user.favourited_recipes.include?(recipe) %>
---
SELECT "recipes".* FROM "recipes"

    <div class="box-body">
      <p>by <%= recipe.user.first_name.capitalize %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]