app/views/recipes/_ingredient_form.html.erb

SELECT "ingredients".* FROM "ingredients"
---
<div class="nested-form-wrapper" data-new-record="<%= f.object.new_record? %>">
  <%= f.input :ingredient_id, collection: Ingredient.all, label_method: :name, label_value: :id, include_hidden: false %>