app/views/recipes/index.html.erb

SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
---
      </div>
      <p class="card-text recipe-extract">You have <%= recipe.recipe_ingredients.count %> ingredients in this recipe</p>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <div class="box-body">
          <p>by <%= recipe.user.first_name.capitalize! %> <%= recipe.user.last_name.capitalize! %></p>