app/views/recipes/show.html.erb

SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
---
            <ul>
              <% @recipe.recipe_ingredients.each do |recipe_ingredient| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 1]]
---
          </div>
          <div><% if @recipe.reviews.blank? %>