app/views/recipes/user_recipes.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
---
      <div class="inner-flex">
        <p class="card-text recipe-extract">You have <%= user_recipe.recipe_ingredients.count %> ingredients in this recipe</p>