app/views/list_ingredients/_add_ingredient_form.html.erb

SELECT "ingredients".* FROM "ingredients"
---
<%= simple_form_for [@list, @list_ingredient], url: list_list_ingredients_path(@list) do |f| %>
  <%= f.input :ingredient_id, collection: Ingredient.all, label_method: :name, label_value: :id, label: false %>