app/views/list_ingredients/_edit_ingredient_form.html.erb

    <%= form.label :ingredient_id, "Ingredient" %>
    <%= form.collection_select :ingredient_id, Ingredient.all, :id, :name, {}, class: "form-control" %>
---
SELECT "ingredients".* FROM "ingredients"