app/controllers/fridges_controller.rb

  def show
    @list = List.find_by(id: params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_fridge
    @fridge = Fridge.find_by(id: params[:id])
---
SELECT "fridges".* FROM "fridges" WHERE "fridges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]