app/controllers/fridges_controller.rb

SELECT "fridges".* FROM "fridges" WHERE "fridges"."user_id" = $1 LIMIT $2  [["user_id", 22], ["LIMIT", 1]]
---
  def set_fridge
    @fridge = Fridge.find_by(user: current_user)