app/controllers/list_ingredients_controller.rb

  def create
    @list_ingredient = ListIngredient.new(list_ingredient_params)
    @ingredient = Ingredient.new(ingredient_params)
    @list_ingredient.list = List.find(params[:list_id])
    @list_ingredient.ingredient = @ingredient
    authorize @ingredient
    authorize @list_ingredient
    if @ingredient.save! && @list_ingredient.save!
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "list_ingredients" ("ingredient_id", "list_id", "quantity", "created_at", "updated_at", "unit") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ingredient_id", 19], ["list_id", 1], ["quantity", nil], ["created_at", "2023-03-23 10:54:19.138573"], ["updated_at", "2023-03-23 10:54:19.138573"], ["unit", ""]]

  def destroy
    authorize @list_ingredient
    @list_ingredient.destroy
---
DELETE FROM "list_ingredients" WHERE "list_ingredients"."id" = $1  [["id", 1]]

  def edit
    @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_list_ingredient
    @list_ingredient = ListIngredient.find(params[:id])
---
SELECT "list_ingredients".* FROM "list_ingredients" WHERE "list_ingredients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]