app/controllers/lists_controller.rb

  def destroy
    authorize @list
    @list.destroy
---
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 3]]

  def bulk_update
    skip_authorization
    @list_ingredient = ListIngredient.new
    @ingredient = @list_ingredient.ingredient
    @selected_list_ingredients = ListIngredient.where(id: params.fetch(:list_ingredient_ids, []).compact)
    if params[:commit] == 'bought'
      @selected_list_ingredients.each do |si|
        fridge_ingredient = FridgeIngredient.new(fridge_ingredient_params)
        fridge_ingredient.create(quantity: list_ingredient.quantity, quantity: list_ingredient.quantity)
      end
      selected_list_ingredients.destroy_all
---
SELECT "list_ingredients".* FROM "list_ingredients" WHERE "list_ingredients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "fridge_ingredients" ("ingredient_id", "fridge_id", "quantity", "created_at", "updated_at", "unit") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ingredient_id", 432], ["fridge_id", 2], ["quantity", nil], ["created_at", "2023-03-23 16:27:10.098047"], ["updated_at", "2023-03-23 16:27:10.098047"], ["unit", ""]]
DELETE FROM "list_ingredients" WHERE "list_ingredients"."id" = $1  [["id", 3]]

  def set_list
    @list = List.find_by(id: params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]