app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user = current_user
    @recipe_ingredient = RecipeIngredient.new(recipe_ingredient_params)
    @ingredient = Ingredient.new(ingredient_params)
    @recipe_ingredient.recipe = Recipe.find(params[:recipe_id])
    @recipe_ingredient.ingredient = @ingredient
    authorize @ingredient
    authorize @recipe_ingredient
    if @recipe.save! && @ingredient.save! && @recipe_ingredient.save!
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id", "quantity", "created_at", "updated_at", "unit") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["recipe_id", 2], ["ingredient_id", 2], ["quantity", 4], ["created_at", "2023-03-25 14:10:32.571226"], ["updated_at", "2023-03-25 14:10:32.571226"], ["unit", "kg"]]
INSERT INTO "recipes" ("prep_time", "instruction", "difficulty", "utensil", "title", "cooking_time", "total_time", "serving", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    authorize @recipe
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "title" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["title", "'All about the lamb' – roast loin of lamb with baby courgettes and basil purée  "], ["updated_at", "2023-03-27 15:42:20.882303"], ["id", 4]]

  def set_recipe
    @recipe = Recipe.find_by(id: params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]