app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "first_name", "last_name", "phone_number", "language", "address", "country", "city", "post_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
INSERT INTO "fridges" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["name", "My Fridgi"], ["created_at", "2023-03-22 10:32:33.646864"], ["updated_at", "2023-03-22 10:32:33.646864"]]
INSERT INTO "lists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My List"], ["user_id", 2], ["created_at", "2023-03-22 10:32:33.657209"], ["updated_at", "2023-03-22 10:32:33.657209"]]
---
  def create
    build_resource(sign_up_params)

    resource.save
    yield resource if block_given?
    if resource.persisted?
      if resource.active_for_authentication?
        fridge = Fridge.new(name: 'My Fridgy')
        fridge.user = resource
        fridge.save!
        list = List.new(name: 'My Fridgy')
        list.user = resource
        list.save!